Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: Array of virtual function descriptors. Each VF descriptor is a dictionary mapping attribute names to GVariant values. The 'index' entry is mandatory for each VF. When represented as string a VF is in the form: "INDEX [ATTR=VALUE[ ATTR=VALUE]...]". for example: "2 mac=00:11:22:33:44:55 spoof-check=true". Multiple VFs can be specified using a comma as separator. Currently the following attributes are supported: mac, spoof-check, trust, min-tx-rate, max-tx-rate, vlans. The "vlans" attribute is represented as a semicolon-separated list of VLAN descriptors, where each descriptor has the form "ID[.PRIORITY[.PROTO]]". PROTO can be either 'q' for 802.1Q (the default) or 'ad' for 802.1ad.
en: 虛函數描述符的數組。每個VF描述符都是將屬性名稱映射到GVariant值的字典。每個VF都必須輸入'index'條目。當表示為字符串時，VF的格式為：“INDEX [ATTR = VALUE [ATTR = VALUE] ...]”。例如：“2 mac = 00：11：22：33：44：55 spoof-check = true”。 “vlans”屬性表示為以半色分隔的VLAN描述符列表，其中每個描述符的格式為“ID [.PRIORITY [.PROTO]]”。 PROTO可以是802.1Q（默認值）的“q”或802.1ad的“ad”。

source: Array operands are incommensurate at %L
en: %L 處陣列運算元無法被使用

source: Array pointer '%s' at %L must have a deferred shape
en: 陣列指標「%s」在 %L 處必須有延遲的外形

source: Array reference at %C cannot have more than %d dimensions
en: %C 處的任何參照都不能多於 %d 維

source: Array reference out of bounds
en: 對陣列的參照超出範圍

source: Array section with a vector subscript at %L shall not be the target of a pointer
en: %L 處由向量下標選擇的部分陣列不應是指標的目的

source: Array specification must be deferred at %L
en: %L 處陣列指定必須延遲

source: Ask for this password every time
en: 每次都詢問此密碼

source: Ask me for each file individually
en: Ask mi für evri fayl indivaidolli

source: Assigned label is not a target label
en: 賦值標籤不是目的標籤

source: Assignment to a FORALL index variable at %L
en: %L 處向 FORALL 索引變數賦值

source: Assume GAS
en: 假定 GAS

source: Assume a large TLS segment
en: 假定大的執行緒局部存儲段

source: Assume all symbols have 32-bit values
en: 假定所有號都有 32 位元值

source: Assume code will be assembled by GAS
en: 假定程式碼將由 GAS 組譯

source: Assume code will be linked by GNU ld
en: 假定程式碼將由 GNU ld 連結

source: Assume code will be linked by HP ld
en: 假定程式碼將由 HP ld 連結

source: Assume floating-point operations can trap
en: 假定浮點運算可能引發陷阱

source: Assume native functions are implemented using JNI
en: 假定本地函式使用 JNI 實作

source: Assume normal C execution environment
en: 假定一般的 C 執行環境

source: Assume possible double misalignment
en: 假定可能的兩不正確齊

source: Assume signed arithmetic overflow wraps around
en: 假定有號運算溢出時回繞

source: Assume small address space
en: 假定小位址空間

source: Assume symbols might be invalid
en: 假定符號可能無效

source: Assume target CPU is configured as big endian
en: 假定目的 CPU 被配置為高位位元組在前

source: Assume target CPU is configured as little endian
en: 假定目的 CPU 被配置為低位位元組在前

source: Assume that receivers of Objective-C messages may be nil
en: 假定 Objective-C 訊息的接受者可能是 nil

source: Assume that the source file is fixed form
en: 假定來源檔案是固定格式的

source: Assume that the source file is free form
en: 假定來源檔案是自由格式

source: Assume the VxWorks RTP environment
en: 假定 VxWorks RTP 環境

source: Assume the VxWorks vThreads environment
en: 假定 VxWorks vThreads 環境

source: Assume the runtime uses a hash table to map an object to its synchronization structure
en: 假定執行時使用一張雜湊表完成從物件到其同步結構的對應

source: Assumed shape array at %L must be a dummy argument
en: 假定外形的陣列在 %L 處必須是啞引數

source: Assumed size array at %L must be a dummy argument
en: 假定大小的陣列在 %L 處必須是啞引數

source: Attempt to fill delay slots of branch instructions
en: 試圖利用延遲轉移指令後

source: Attempt to merge identical constants and constant variables
en: 試圖合併相同的常數和常變數

source: Authentication
en: 身份認證

source: Authentication required by wireless network
en: 無線網路所需的身份認證

source: AutoIP service error
en: AutoIP 服務錯誤

source: AutoIP service failed
en: AutoIP 服務失敗

source: AutoIP service failed to start
en: AutoIP 服務啟用失敗

source: Automatic
en: 自動

source: Automatic (DHCP-only)
en: 自動（僅使用 DHCP）

source: Automatic array '%s' at %L cannot have an initializer
en: 自動陣列「%s」在 %L 處不能有初始值設定

source: Automatically _break lines at right margin on commit
en: 提交時自動在右側邊界處斷列(_B)

source: Automatically check for updates
en: Òtomätikolli ček für ùpdeits

source: Automatically compare all differing files on startup
en: 啟動時自動比對所有不同的檔案

source: Automatically compile MO file when saving
en: Òtomätikolli kompail MO fayl when seiviŋ

source: Automatically connect
en: 自動連線

source: Automatically hard-wrap commit messages
en: 提交時自動強制實體換列

source: Automatically merge files
en: 自動合併檔案

source: Available properties: %s
en: 可用的內容：%s

source: Available settings: %s
en: 可用設定：%s

source: Available to all users
en: 所有使用者皆可使用

source: Avoid generating pc-relative calls; use indirection
en: 避免產生相對 PC 的呼叫；使用間接呼叫

source: BYTE type used at %C is not available on the target machine
en: %C 使用到的 BYTE 類型在目標平臺上不可

source: Back
en: 上一步

source: Bad array reference at %L
en: %L 處陣列參照錯誤

source: Bad byte codes.
en: 錯誤的位元組碼。

source: Bad continuation line at %C
en: %C 處錯誤的續列

source: Bad kind for logical constant at %C
en: %C 處邏輯常數的種別錯誤

source: Bad name
en: 錯誤的名稱

source: Bad operator
en: 錯誤的運算子

source: Bad type in constant expression
en: 常數運算式中類型錯誤

source: Base
en: 基礎

source: Base color scheme for Meld highlighting
en: 用於 Meld 標示的基礎配色方案

source: Base path:
en: Beisik paŧwei:

source: Base type of the connection. For hardware-dependent connections, should contain the setting name of the hardware-type specific setting (ie, "802-3-ethernet" or "802-11-wireless" or "bluetooth", etc), and for non-hardware dependent connections like VPN or otherwise, should contain the setting name of that setting type (ie, "vpn" or "bridge", etc).
en: 連接的基本類型。對於依賴於硬件的連接，應包含硬件類型特定設置的設置名稱（即“802-3-ethernet”或“802-11-wireless”或“bluetooth”等），以及非硬件相關設置VPN或其他類似的連接應包含該設置類型的設置名稱（即“vpn”或“bridge”等）。

source: Based on the open source version →
en: Beisen ùpon đe opènsōrs vörçion →

source: Beta expired
en: Beta ikspairen

source: Beta versions contain the latest new features and improvements, but may be a bit less stable.
en: Beta vörçions kontein the leitest niu features en impruvments, but possibolli bufun wa not steibol.

source: Bluetooth
en: 藍牙

source: Bond connection %d
en: Bond 連線 %d

source: Bonding mode. One of "active-backup", "balance-slb", or "balance-tcp".
en: 綁定模式。 “active-backup”，“balance-slb”或“balance-tcp”之一。

source: Branches are this expensive (1-5, arbitrary units)
en: 指定分支的代價(1-5，任意單位)

source: Branches executed:%s of %d
en: 執行的分支：%s (共有 %d 個)

source: Bridge
en: 橋接

source: Bridge connection %d
en: 橋接連線 %d

source: Bring All to Front
en: Briŋ Ol tu Frònt

source: Broadcast
en: 廣播

source: Broken catalog file: plural form msgstr used without msgid_plural
en: Breiken katalog fayl: plurol-form msgstr yusen wiŧout msgid_plural

source: Broken catalog file: singular form msgstr used together with msgid_plural
en: Breiken katalog fayl: singolar-form msgstr yusen tugäđā wiŧ msgid_plural

source: Browse
en: Braws

source: Browser only [no]
en: 僅瀏覽器[否]

source: Buy Online…
en: Pörčeis Onlain…

source: Buy online…
en: Pörčeis onlain…

source: Byte-width of the serial communication. The 8 in "8n1" for example.
en: 串行通信的字節寬度。例如，“8n1”中的8。

source: C&atalog
en: K&atalog

source: C&lear
en: K&līr

source: CA certificate must be in X.509 format
en: CA證書必須採用X.509格式

source: CHARACTER(*) function '%s' at %L cannot be array-valued
en: CHARACTER(*) 函式「%s」(位於 %L)不能以陣列賦值

source: CHARACTER(*) function '%s' at %L cannot be pointer-valued
en: CHARACTER(*) 函式「%s」(位於 %L)不能以指標賦值

source: CHARACTER(*) function '%s' at %L cannot be pure
en: CHARACTER(*) 函式「%s」(位於 %L)不能是純量

source: COMPLEX quantities cannot be compared at %L
en: %L 處複數不能比較大小

source: CPU you selected does not support x86-64 instruction set
en: 您選擇的 CPU 不支援 x86-64 指令集

source: CRIS-port assertion failed:
en: CRIS-port 判定語錯誤：

source: C_ompare
en: 比對(_O)

source: C_ompare files based only on size and timestamp
en: 只按照大小和時間戳記比對檔案(_O)

source: Calls executed:%s of %d
en: 執行的呼叫：%s(共 %d)

source: Can Poedit contribute your translations of this file to the online translation memory?
en: Poedit-wa neide transleiçion to nige fayl de kontribyçion ga onlain transleiçion memori nie transforing possibol gga?

source: Can't convert %s to %s at %L
en: 不能將 %s 轉換為 %s，於 %L

source: Can't open file '%s'
en: 無法開啟檔案「%s」

source: Can't open module file '%s' for reading at %C: %s
en: 無法開啟模組檔案「%s」讀取，在 %C 處：%s

source: Can't open module file '%s' for writing at %C: %s
en: 無法開啟模組檔案「%s」寫入，在 %C 處：%s

source: Cancel
en: 取消

source: Cannot compare a mixture of files and directories
en: 無法對檔案和資料夾混合比對

source: Cannot create '%s': %s
en: 不能創造 '%s': %s

source: Cannot create temporary directory.
en: Krieit temporari direktoris wa feilen.

source: Cannot execute program: %s
en: Iksikyut progrem feilen: %s

source: Cannot import:
en: 無法匯入：

source: Cannot open '%s' for output.
en: 不能為輸出開啟「%s」。

source: Cannot set '%s' without '%s'
en: 無法設置'%s' 沒有'%s'

source: Capitalize
en: Käpitolais

source: Carrier/link changed
en: 載體/連結已更改

source: Catalog
en: Katalog

source: Catalog modified. Do you want to save changes?
en: Katalog modifaien. Ayisyur nei diŋyǐu seiv čeijns?

source: Catalog properties
en: Katalog propertis

source: Catalogs &Manager
en: Katalog &Männeijā

source: Catalogs &manager
en: Katalog &männeijā

source: Catalogs Manager
en: Katalogs Männeijā

source: Change UI language
en: Čeinjs YI leŋgueij

source: Change highlighting incomplete
en: 變更標示不完整

source: Change the ABI to allow double word insns
en: 變更 ABI 以允許雙字指令

source: Change the maximum length of conditionally-executed sequences
en: 變更條件執行序列的最大長度

source: Change trimming
en: 變更修剪

source: Changes
en: 變更

source: Changes made to the following documents will be permanently lost:
en: 對下列文件的變更將永久遺失：

source: Channel
en: 頻道

source: Channel on which the mesh network to join is located.
en: 要連接的網狀網絡所在的通道。

source: Characters
en: Käraktās

source: Characters are counted including spaces.
en: Käraktās wa kaunten inkludiŋ speises.

source: Charset:
en: Kärset:

source: Check Document Now
en: Ček Dokyumènt Nau

source: Check Grammar With Spelling
en: Ček Grämmar Wiŧ Speliŋ

source: Check Spelling While Typing
en: Ček Speliŋ When Taipiŋ

source: Check for Updates…
en: Ček Für Ù&pdeits…

source: Check for errors in the translation
en: Ček für öras in transleiçion

source: Check for syntax errors, then stop
en: 檢查語法錯誤，然後停止

source: Check spelling
en: Ček speliŋ

source: Check the return value of new
en: 檢查 new 的回傳值

source: Choices for file order are remote/merged/local and local/merged/remote. This preference only affects three-way comparisons launched from the version control view, so is used solely for merges/conflict resolution within Meld.
en: 檔案順序的選擇有遠端/合併/本地和本地/合併/遠端。此偏好設定僅影響從版本控制檢視啟動的三向比對，因此僅用於 Meld 中的合併/衝突解決。

source: Choose this if you want to translate the theme or plugin into your language.
en: Silekt nigè if nei rikwair tu transleit đe đöme or plùgin intu neidè leŋgueij.

source: Choose which version control system to use
en: 選擇要使用的版本控制系統

source: Cirrus: Place NOPs to avoid invalid instruction combinations
en: Cirrus：插入 NOP 以避免無效的指令組合

source: Clear
en: 清除

source: Clear Synchronization Points
en: 清除同步點

source: Clear Translation
en: Klīr Transleiçion

source: Clear sychronization points for changes between files
en: 清除檔案差異同步點

source: Clear the comment
en: Klīr komment

source: Clear translation
en: Klīr transleiçion

source: Client
en: 用戶端

source: Cloned MAC address
en: 複製的 MAC 位址

source: Close
en: Klos

source: Close _without Saving
en: 關閉但不儲存(_W)

source: Close a comparison
en: 關閉比對

source: Close tab
en: 關閉分頁

source: Close the current file
en: 關閉目前的檔案

source: Closing %s failed: %s
en: 關閉 %s 失敗：%s

source: Co_mmit
en: 提交(_M)

source: Co_mmit…
en: 提交(_M)…

source: Code size: small, medium or large
en: 程式碼大小：小、中或大

source: Collaborate on a translation with others
en: Kolläboreit ùpon 1-gè transleiçion wiŧ kitadè pīpol

source: Collapse Recursively
en: 遞迴摺疊

source: Collapse selected folder and all subfolders
en: 摺疊選取的資料夾及所有子資料夾

source: Collecting source files…
en: Kollektiŋ sōrs fayls…

source: Color scheme to use for syntax highlighting
en: 語法標示使用的配色方案

source: Column Name
en: 欄位名稱

source: Columns to display
en: 要顯示的欄位

source: Command to extract translations:
en: Kommand tu iksträkt transleiçions:

source: Comment:
en: Komment:

source: Commit
en: 提交

source: Commit Files
en: 提交檔案

source: Commit Messages
en: 提交訊息

source: Commit changes to version control
en: 提交變更至版本控制

source: Commit to version control
en: 提交至版本控制

source: Compare and merge your files
en: 比對及合併您的檔案

source: Compare selected files
en: 比對選取的檔案

source: Comparison results will be inaccurate
en: 比對結果可能不準確

source: Compile for 32-bit pointers
en: 為 32 位元指標編譯

source: Compile for 64-bit pointers
en: 為 64 位元指標編譯

source: Compile for ETRAX 100 (CRIS v8)
en: 為 ETRAX 100 (CRIS v8) 編譯

source: Compile for ETRAX 4 (CRIS v3)
en: 為 ETRAX 4 (CRIS v3) 編譯

source: Compile for the m32r
en: 為 m32r 編譯

source: Compile for the m32r2
en: 為 m32r2 編譯

source: Compile for the m32rx
en: 為 m32rx 編譯

source: Compile for the v850 processor
en: 為 v850 處理器編譯

source: Compile for the v850e processor
en: 為 v850e 處理器編譯

source: Compile to…
en: Kompail tu…

source: Compile whole compilation unit at a time
en: 一次編譯一整個編譯單元

source: Compiled Translation Files
en: Kompailen Transleiçion Fayls

source: Component '%s' at %C is a PRIVATE component of '%s'
en: 元件「%s」在 %C 處是「%s」的 PRIVATE 元件

source: Component at %C must have the POINTER attribute
en: %C 處的元件必須有 POINTER 屬性

source: Concat operator at %L must concatenate strings of the same kind
en: %L 處的粘貼運算子必須粘貼同一種別的字串

source: Config directory location
en: 配置目錄位置

source: Config file location
en: 配置檔案位置

source: Configure IPv6 Privacy Extensions for SLAAC, described in RFC4941. If enabled, it makes the kernel generate a temporary IPv6 address in addition to the public one generated from MAC address via modified EUI-64. This enhances privacy, but could cause problems in some applications, on the other hand. The permitted values are: -1: unknown, 0: disabled, 1: enabled (prefer public address), 2: enabled (prefer temporary addresses). Having a per-connection setting set to "-1" (unknown) means fallback to global configuration "ipv6.ip6-privacy". If also global configuration is unspecified or set to "-1", fallback to read "/proc/sys/net/ipv6/conf/default/use_tempaddr". Note that this setting is distinct from the Stable Privacy addresses that can be enabled with the "addr-gen-mode" property's "stable-privacy" setting as another way of avoiding host tracking with IPv6 addresses.
en: 為RFCA41配置SLAAC的IPv6 Privacy Extensions。如果啟用，它會使內核生成臨時IPv6地址，以及通過修改後的EUI-64從MAC地址生成的公共IPv6地址。這增強了隱私，但另一方面可能會在某些應用程序中引起問題。允許的值為：-1：未知，0：禁用，1：啟用（首選公共地址），2：啟用（更喜歡臨時地址）。將每個連接設置設置為“-1”（未知）意味著回退到全局配置“ipv6.ip6-privacy”。如果未指定全局配置或將其設置為“-1”，則回退到“/ proc / sys / net / ipv6 / conf / default / use_tempaddr”。請注意，此設置不同於可以使用“addr-gen-mode”屬性的“stable-privacy”設置啟用的穩定隱私地址，作為避免使用IPv6地址進行主機跟踪的另一種方法。

source: Configure method for creating the address for use with RFC4862 IPv6 Stateless Address Autoconfiguration. The permitted values are: NM_SETTING_IP6_CONFIG_ADDR_GEN_MODE_EUI64 (0) or NM_SETTING_IP6_CONFIG_ADDR_GEN_MODE_STABLE_PRIVACY (1). If the property is set to EUI64, the addresses will be generated using the interface tokens derived from hardware address. This makes the host part of the address to stay constant, making it possible to track host's presence when it changes networks. The address changes when the interface hardware is replaced. The value of stable-privacy enables use of cryptographically secure hash of a secret host-specific key along with the connection's stable-id and the network address as specified by RFC7217. This makes it impossible to use the address track host's presence, and makes the address stable when the network interface hardware is replaced. On D-Bus, the absence of an addr-gen-mode setting equals enabling stable-privacy. For keyfile plugin, the absence of the setting on disk means EUI64 so that the property doesn't change on upgrade from older versions. Note that this setting is distinct from the Privacy Extensions as configured by "ip6-privacy" property and it does not affect the temporary addresses configured with this option.
en: 配置創建用於RFC4862 IPv6無狀態地址自動配置的地址的方法。允許的值為：NM_SETTING_IP6_CONFIG_ADDR_GEN_MODE_EUI64（0）或NM_SETTING_IP6_CONFIG_ADDR_GEN_MODE_STABLE_PRIVACY（1）。如果屬性設置為EUI64，則將使用從硬件地址派生的接口令牌生成地址。這使得地址的主機部分保持不變，從而可以在主機改變網絡時跟踪主機的存在。更換接口硬件時地址會發生變化。 stable-privacy的值允許使用秘密主機特定密鑰的加密安全散列以及RFC7217規定的連接的stable-id和網絡地址。這使得無法使用地址跟踪主機的存在，並在更換網絡接口硬件時使地址穩定。在D-Bus上，缺少addr-gen-mode設置等於實現穩定隱私。對於密鑰文件插件，磁盤上缺少設置意味著EUI64，以便在從舊版本升級時屬性不會更改。請注意，此設置與“ip6-privacy”屬性配置的Privacy Extensions不同，它不會影響使用此選項配置的臨時地址。

source: Configure source code extraction in Properties.
en: Konfigyur sōrskoud iksträkçion in Propèrtis.

source: Configure the application
en: 設定程式

source: Configure the token for draft-chown-6man-tokenised-ipv6-identifiers-02 IPv6 tokenized interface identifiers. Useful with eui64 addr-gen-mode.
en: 為draft-chown-6man-tokenised-ipv6-identifiers-02 IPv6標記化接口標識符配置令牌。適用於eui64 addr-gen-mode。

source: Configured with: %s
en: 配置為：%s

source: Confirmation
en: Konförmeiçion

source: Conflict
en: 衝突

source: Conform to the ISO 1990 C standard
en: 遵循 ISO 1990 C 標準

source: Conform to the ISO 1990 C standard as amended in 1994
en: 遵循 ISO 1990 C 標準於 1994 年修訂的版本

source: Conform to the ISO 1990 C standard with GNU extensions
en: 遵循 ISO 1990 C 標準，也支援 GNU 擴充

source: Conform to the ISO 1999 C standard
en: 遵循 ISO 1999 C 標準

source: Conform to the ISO 1999 C standard with GNU extensions
en: 遵循 ISO 1999 C 標準，也支援 GNU 擴充

source: Confused: multiple main plugin files.
en: Konyusen: mùltipol mein plùgin fayls.

source: Connect to the Internet to get additional suggestions.
en: Konnekt tu đe Internet für addeiçionol sùjjesçions.

source: Connected
en: 已連線

source: Connecting
en: 正在連線

source: Connecting...
en: 連接中...

source: Connection '%s' (%s) successfully added.
en: 連線「%s」 (%s) 已成功新增。

source: Connection '%s' (%s) successfully modified.
en: 連線「%s」(%s) 已成功修改。

source: Connection '%s' (%s) successfully saved.
en: 連線「%s」(%s) 已成功儲存。

source: Connection Token for Stable IDs
en: 穩定ID的連接令牌

source: Connection is already active
en: 連線已啟用

source: Connection removed before it was initialized
en: 在初始化之前刪除了連接

source: Connection sharing via a protected Wi-Fi network
en: 透過受保護的 Wi-Fi 網路共享連線

source: Connection sharing via an open Wi-Fi network
en: 透過開放的 Wi-Fi 網路共享連線

source: Connection successfully activated (%s) (D-Bus active path: %s)
en: 連接成功激活（%s) （D-Bus活動路徑： %s)

source: Connection successfully activated (D-Bus active path: %s)
en: 連線已成功啟用（D-Bus 啟用路徑：%s）

source: Connectivity
en: 連線性

source: Consider differently-cased filenames that are otherwise-identical to be the same
en: 將除了大小寫不同、其他完全一致的檔案名稱視為相同

source: Consider type 'int' to be 16 bits wide
en: 認為「int」類別有 16 位寬

source: Consider type 'int' to be 32 bits wide
en: 認為「int」類別有 32 位元寬

source: Console
en: 主控台

source: Console output
en: 主控台輸出

source: Constant expression required at %C
en: %C 處需要常數運算式

source: Constraint for server domain name. If set, this FQDN is used as a suffix match requirement for dNSName element(s) of the certificate presented by the authentication server during the inner "phase 2" authentication. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using same suffix match comparison.
en: 服務器域名的約束。如果設置，則此FQDN用作在內部“階段2”認證期間由認證服務器呈現的證書的dNSName元素的後綴匹配要求。如果找到匹配的dNSName，則滿足此約束。如果不存在dNSName值，則使用相同的後綴匹配比較將此約束與SubjectName CN匹配。

source: Constraint for server domain name. If set, this FQDN is used as a suffix match requirement for dNSName element(s) of the certificate presented by the authentication server. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using same suffix match comparison.
en: 服務器域名的約束。如果設置，則此FQDN用作認證服務器提供的證書的dNSName元素的後綴匹配要求。如果找到匹配的dNSName，則滿足此約束。如果不存在dNSName值，則使用相同的後綴匹配比較將此約束與SubjectName CN匹配。

source: Contains the "phase 2" CA certificate if used by the EAP method specified in the "phase2-auth" or "phase2-autheap" properties. Certificate data is specified using a "scheme"; two are currently supported: blob and path. When using the blob scheme (which is backwards compatible with NM 0.7.x) this property should be set to the certificate's DER encoded data. When using the path scheme, this property should be set to the full UTF-8 encoded path of the certificate, prefixed with the string "file://" and ending with a terminating NUL byte. This property can be unset even if the EAP method supports CA certificates, but this allows man-in-the-middle attacks and is NOT recommended.
en: 如果由“phase2-auth”或“phase2-autheap”屬性中指定的EAP方法使用，則包含“階段2”CA證書。證書數據使用“方案”指定;目前支持兩種：blob和path。使用blob方案（向後兼容NM 0.7.x）時，應將此屬性設置為證書的DER編碼數據。使用路徑方案時，應將此屬性設置為證書的完整UTF-8編碼路徑，前綴為字符串“file：//”，並以終止NUL字節結束。即使EAP方法支持CA證書，也可以取消設置此屬性，但這樣可以允許中間人攻擊，不建議這樣做。

source: Contains the "phase 2" client certificate if used by the EAP method specified in the "phase2-auth" or "phase2-autheap" properties. Certificate data is specified using a "scheme"; two are currently supported: blob and path. When using the blob scheme (which is backwards compatible with NM 0.7.x) this property should be set to the certificate's DER encoded data. When using the path scheme, this property should be set to the full UTF-8 encoded path of the certificate, prefixed with the string "file://" and ending with a terminating NUL byte. This property can be unset even if the EAP method supports CA certificates, but this allows man-in-the-middle attacks and is NOT recommended.
en: 如果由“phase2-auth”或“phase2-autheap”屬性中指定的EAP方法使用，則包含“階段2”客戶端證書。證書數據使用“方案”指定;目前支持兩種：blob和path。使用blob方案（向後兼容NM 0.7.x）時，應將此屬性設置為證書的DER編碼數據。使用路徑方案時，應將此屬性設置為證書的完整UTF-8編碼路徑，前綴為字符串“file：//”，並以終止NUL字節結束。即使EAP方法支持CA證書，也可以取消設置此屬性，但這樣可以允許中間人攻擊，不建議這樣做。

source: Contains the "phase 2" inner private key when the "phase2-auth" or "phase2-autheap" property is set to "tls". Key data is specified using a "scheme"; two are currently supported: blob and path. When using the blob scheme and private keys, this property should be set to the key's encrypted PEM encoded data. When using private keys with the path scheme, this property should be set to the full UTF-8 encoded path of the key, prefixed with the string "file://" and ending with a terminating NUL byte. When using PKCS#12 format private keys and the blob scheme, this property should be set to the PKCS#12 data and the "phase2-private-key-password" property must be set to password used to decrypt the PKCS#12 certificate and key. When using PKCS#12 files and the path scheme, this property should be set to the full UTF-8 encoded path of the key, prefixed with the string "file://" and ending with a terminating NUL byte, and as with the blob scheme the "phase2-private-key-password" property must be set to the password used to decode the PKCS#12 private key and certificate.
en: 當“phase2-auth”或“phase2-autheap”屬性設置為“tls”時，包含“階段2”內部私鑰。密鑰數據使用“方案”指定;目前支持兩種：blob和path。使用blob方案和私鑰時，應將此屬性設置為密鑰的加密PEM編碼數據。使用具有路徑方案的私鑰時，應將此屬性設置為密鑰的完整UTF-8編碼路徑，前綴為字符串“file：//”，並以終止NUL字節結束。使用PKCS＃12格式私鑰和blob方案時，此屬性應設置為PKCS＃12數據，並且“phase2-private-key-password”屬性必須設置為用於解密PKCS＃12證書的密碼，鍵。使用PKCS＃12文件和路徑方案時，應將此屬性設置為密鑰的完整UTF-8編碼路徑，前綴為字符串“file：//”，並以終止NUL字節結束，並且與blob方案必須將“phase2-private-key-password”屬性設置為用於解碼PKCS＃12私鑰和證書的密碼。
